Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadCombination.Modify Method
 Modifies an analysis load combination. The AnalysisModelName and ID have to be set.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Modify()
Public Sub Modify
See Also
Reference
AnalysisLoadCombination Class
Tekla.Structures.Analysis Namespace